MKS = {'mks', 'マリオカートスタジアム', 'まりおかーとすたじあむ', 'マリカス', 'まりかす'}
WP = {'wp', 'ウォーターパーク','うぉーたーぱーく','うぉたぱ', 'ウォタパ'}
SSC = {'ssc', 'スイーツキャニオン', 'すいーつきゃにおん', 'スイキャニ', 'すいきゃに'}
TR = {'tr', 'ドッスン遺跡', 'どっすんいせき', 'ドッスンいせき', 'ドッスンイセキ', 'ドッスン', 'どっすん', 'いせき', '遺跡', 'イセキ'}

MC = {'mc', 'マリオサーキット', 'マリサ', 'まりおさーきっと', 'まりさ', '新マリサ', 'しんまりさ', 'シンマリサ', '新まりさ'}
TH = {'th', 'キノピオハーバー', 'きのぴおはーばー', 'はーばー', 'ハーバー'}
TM = {'tm', 'ねじれマンション', 'ねじれまんしょん', 'ねじまん', 'ねじマン', 'ネジマン', 'まんしょん', 'マンション', 'ねじれ', 'ネジレ', 'ねじ', 'ネジ'}
SGF = {'sgf', 'へいほーこうざん', 'ヘイホー鉱山', 'ヘイホーこうざん', 'へいほー鉱山', 'へいこう', 'ヘイコウ', 'へい鉱', 'ヘイ鉱', 'ヘイこう'}

SA = {'sa', 'サンシャイン空港', 'サンシャインくうこう', 'さんしゃいんくうこう', '空港', 'くうこう'}
DS = {'ds', 'ドルフィンみさき', 'ドルフィン岬', 'どるふぃんみさき', 'どるふぃん岬', 'どるみ', 'ドルミ', 'どるふぃん', 'ドルフィン'}
Ed = {'ed', 'エレドリ', 'エレド', 'エレクトロドリーム', 'えれどり', 'えれど', 'えれくとろどりーむ'}
MW = {'mw', 'ワリオスノーマウンテン', 'わりおすのーまうんてん', 'ワリスノ', 'わりすの', '雪山', 'ゆきやまうんてん', 'すの', 'スノ'}

CC = {'cc', 'スカイガーデン', 'スカガ', 'スカが', 'すかが',  'すかいがーでん'}
BDD = {'bdd', 'ホネホネさばく', 'ホネホネ砂漠', 'ほねほねさばく', 'ほねほね砂漠', '骨骨砂漠', '骨骨さばく', 'ホネホネサバク', 'ほねさば', '骨サバ', 'ホネサバ', '骨', 'ほね', 'ホネ', 'ほねほね', '骨骨', 'ホネホネ'}
BC = {'bc', 'クッパキャッスル', 'くっぱきゃっする', 'くっきゃぱっする', 'クッキャパッスル', 'くぱきゃ', 'クパキャ'}
RR = {'rr', '新虹', '新にじ', 'しんにじ', 'レインボーロード', 'シンニジ', 'れいんぼーろーど'}

rMMM = {'rmmm', 'mmm', 'モモカン', 'もーもーカントリー', 'モーモーカントリー', 'ももかん', 'もーもーかんとりー', '牛', 'うし'}
rMC = {'rmc', 'gba', 'ぐば', 'グバ', 'gbaまりさ', 'gbaマリサ', 'gbaマリオサーキット', 'gbaまりおさーきっと', 'ジービーエー', 'じーびーえー', 'ぐばまり', 'グバマリ'}
rCCB = {'rccb', 'ccb', 'プクプクビーチ', 'プクプク', 'プクビ', 'ぷくぷくびーち', 'ぷくぷく', 'ぷくび', 'びーち', 'ビーチ'}
rTT = {'rtt', 'tt', 'キノピオハイウェイ', '高速道路', '高速', 'こうそくどうろ', 'こうそく', 'はいうぇい', 'ハイウェイ', 'きのぴおはいうぇい'}

rDDD = {'rddd', 'カラカラ', 'カラサバ', 'からさば', 'からから', 'カラカラ砂漠', 'からからさばく', 'カラカラさばく', 'カラカラサバク', 'GCカラさば'}
rDP3 = {'rdp3', 'dp3', 'ドーナツへいや', 'どーなつへいや', 'ドーナツ平野', 'どーなつ平野', 'ドーナツヘイヤ', '平野', 'へいや'}
rRRy = {'rrry', 'ピーチサーキット', 'ぴーちさーきっと', 'ピチさ', 'ピチサ', 'ぴちさ'}
rDKJ = {'rdkj', 'dkj', 'dk', 'じゃんぐる', 'ジャングル'}

rWS = {'rws', 'ws', 'ワリオスタジアム', 'ワリスタ', 'わりすた', 'わりおすたじあむ'}
rSL = {'rsl', 'sl', 'しゃべらん', 'シャベラン', 'シャーベットランド', 'しゃーべっとらんど', 'シャーベット', 'しゃーべっと'}
rMP = {'rmp', 'mp', 'ミュージックパーク', 'ミューパ', 'ミューぱ', 'みゅーじっくぱーく', 'みゅーぱ'}
rYV = {'ryv', 'yv', 'ヨシバ', 'よっしーバレー', 'よっしーばれー', 'ヨッシーバレー', 'よしば', 'バレー', 'ばれー'}

rTTC = {'rttc', 'ttc', 'チクタクロック', 'チクタク', 'ティックトック', 'チックタック', 'ちっくたっく', 'ちくたくろっく', 'ちくたく'}
rPPS = {'rpps', 'pps', 'パクスラ', 'パックンスライダー', 'ぱくすら', 'ぱっくんすらいだー', 'パックン', 'ぱっくん'}
rGV = {'rgv', 'gv', 'ぐらぐら', 'グラグラ', 'グラグラ火山', 'ぐらぐら火山', 'グラグラカザン', 'ぐらぐらかざん', '火山', 'かざん'}
rRRd = {'rrrd', '64虹', '６４虹', '64にじ', '６４にじ', 'ろくよん', 'ロクヨン'}

dYC = {'dyc', 'yc', 'ヨシサ', 'ヨッシーサーキット', 'よしさ', 'よっしーさーきっと'}
dEA = {'dea', 'ea', 'エキサイトバイク', '役馬', 'エキバ', 'えきば', 'えきさいとばいく'}
dDD = {'ddd', 'dd', 'ドラロ', 'どらろ', 'ドラゴンロード', 'どらごんろーど'}
dMC = {'dmc', 'ミュートシティ', 'ミュート', 'みゅーと', 'みゅーとしてぃ'}

dWGM = {'dwgm', 'wgm', 'ワリオこうざん', 'ワリオ鉱山', 'わりおこうざん', 'わりこう', 'ワリこう', 'ワリ鉱', 'わり鉱'}
dRR = {'drr', 'sfc', 'sfcにじ', 'sfc虹', 'えすえふしー', 'エスエフシー', 'sfcレインボーロード'}
dIIO = {'diio', 'iio', 'ツルツルツイスター', 'つるつるついすたー', 'ツツツ', 'つつつ', 'ツイスター', 'ついすたー', 'ツルツル', 'つるつる'}
dHC = {'dhc', 'hc', 'ハイラルサーキット', 'はいらる', 'はいらるさーきっと', 'ハイラル'}

dBP = {'dbp', 'bp', 'ベビィパーク', 'ベビーパーク', 'べびぃぱーく', 'べびーぱーく', 'べびぱ', 'ベビパ'}
dCL = {'dcl', 'cl', 'チーズランド', 'ちーずらんど', 'ちーず', 'チーズ'}
dWW = {'dww', 'ww', 'ネイチャーロード', 'ねいちゃーろーど', 'ネイチャー', 'ねいちゃー', 'なちゅれ', 'ナチュレ'}
dAC = {'dac', 'ac', 'どうぶつの森', 'どうもり', '動物の森', 'どう森', 'ぶつ森', 'ぶつもり', 'ドウモリ', 'ブツモリ'}

dNBC = {'dnbc', 'nbc', 'ネオクッパシティ', 'ねおくっぱしてぃ', 'ネオぱ', 'ネオパ', 'ねおぱ', 'ねおくっぱ', 'ネオクッパ'}
dRiR = {'drir', 'rir', 'リボンロード', 'リボン', 'りぼんろーど', 'りぼん'}
dSBS = {'dsbs', 'sbs', 'リンリンメトロ', 'りんりんめとろ', 'りんめと', 'リンメト', 'リンリン', 'りんりん', 'リン', 'りん'}
dBB = {'dbb', 'bb', 'ビッグブルー', 'びっぐぶるー', 'ビックブルー', 'びっくぶるー'}

# 追加コース
bPP = {'bpp', 'pp', 'paris', 'ぱり', 'パリ', 'パリプロムナード', 'ぱりぷろむなーど'}
bTC = {'btc', 'tc', 'キノピオサーキット', 'キノサ', 'きのぴおさーきっと', 'きのさ'}
bCMo = {'bcmo', 'cmo', 'bchm', 'chm', 'bcm64', 'cm64', 'チョコマウンテン', 'チョコ', 'チョコマ', 'ちょこまうんてん', 'ちょこま', 'ちょこ', 'チョコ山', 'チョコやま'}
bCMa = {'bcma', 'cma', 'com', 'bcom', 'bcmw', 'cmw', 'ココナッツモール', 'ココモ', 'ココナッツ', 'ここなっつもーる', 'ここも', 'ココナッツ', 'ここなっつ', 'ナッツ', 'なっつ'}

bTB = {'btb', 'tb', 'tokyo', 'トーキョースクランブル', 'スクランブル', 'すくらんぶる', 'とーきょーすくらんぶる', 'トウキョウ', 'トーキョー', 'とうきょう', 'とーきょー', '東京'}
bSR = {'bsr', 'sr', 'キノコリッジウェイ', 'リッジ', 'キコリ', 'きこり', 'りっじ', 'きのこりっじうぇい', 'りっじうぇい', 'リッジウェイ'}
bSG = {'bsg', 'sg', 'gbaスカイガーデン',  'gbaすかいがーでん', 'gbaスカガ', 'gbaすかが', 'グバスカ', 'ぐばすか', 'グバガ', 'ぐばが'}
bNH = {'bnh', 'nh', 'ninja', 'ニンニンドージョー', 'にんにんどーじょー', 'ニンニン', 'にんにん', 'にんじょー', 'ニンジョー', 'ドージョー', 'どうじょう'}

bNYM = {'bnym', 'nym', 'ニューヨークドリーム', 'ニューヨーク', 'ニューヨーク', 'にゅーよーく', 'ニュードリ', 'にゅーどり'}
bMC3 = {'bmc3', 'mc3', 'sfcマリサ', 'sfcまりさ', 'マリサ3', 'まりさ3'}
bKD = {'bkd', 'kd', '64カラカラさばく', '64カラサバ', '64からさば'}
bWP = {'bwp', 'ワルイージピンボール', 'ワルピン', 'わるぴん'}

bSS = {'bss', 'ss', 'シドニーサンシャイン', 'シドニー', 'しどにー'}
bSL = {'bsl', 'スノーランド', 'スノラン', 'すのらん'}
bMG = {'bmg', 'mg', 'キノコキャニオン', 'キノキャニ', 'きのキャニ', 'きのきゃに'}
bSHS = {'bshs', 'shs', 'アイスビルディング', 'アイス', 'あいす'}

bLL = {'bll', 'll', 'ロンドンアベニュー', 'ロンドン'}
bBL = {'bbl', 'bl', 'テレサレイク', 'テレサ', 'てれさ', 'レイク', 'てれれ', 'テレレ'}
bRRM = {'brrm', 'rrm', 'ロックロックマウンテン', 'ロック', 'ロクマ'}
bMT = {'bmt', 'mt','メイプルツリーハウス', 'メイプル', 'めいぷる', 'メープル', 'めーぷる'}

bBB = {'bbb', 'ベルリンシュトラーセ', 'ベルリン'}
bPG = {'bpg', 'pg', 'ピーチガーデン', 'ピチガ'}
bMM = {'bmm', 'mm', 'メリーメリーマウンテン', 'メリマ', 'メリー'}
bRR7 = {'brr7', 'brr', 'rr7', '3dsレインボーロード', '3ds虹', '3dsにじ', '7にじ'}

bAD = {'bad', 'ad', 'Tour アムステルダムブルーム', 'アムステルダムブルーム', 'アムステルダム', 'アムス', 'あむす', 'あむすてるだむ', 'あむすてるだむぶるーむ'}
bRP = {'brp', 'rp', 'GBA リバーサイドパーク', 'GBAリバーサイドパーク', 'リバーサイドパーク', 'リバーサイド', 'リバー', 'リバサ', 'リバパ', 'りばさ', 'りばーさいど', 'りばーさいどぱーく', 'りばー', 'りばぱ'}
bDKS = {'bdks', 'dks', 'Wii DKスノーボードクロス', 'WiiDKスノーボードクロス', 'DKスノーボードクロス', 'スノーボードクロス', 'スノボ', 'すのぼ'}
bYI = {'byi', 'yi', 'ヨッシーアイランド', 'ヨシア', 'よしあ', 'よっしーあいらんど', 'よしじま', 'ヨシじま', 'ヨシアイ', 'よしあい'}

bBR = {'bbr', 'br', 'Tour バンコクラッシュ', 'Tourバンコクラッシュ', 'バンコクラッシュ', 'バンコク', 'バンコ', 'ばんこく', 'ばんこ', 'クラッシュ', 'くらっしゅ'}
bMC = {'bmc', 'DS マリオサーキット', 'DSマリオサーキット', 'dsマリサ', 'dsまりさ'}
bWS = {'bws', 'GC ワルイージスタジアム', 'GCワルイージスタジアム', 'ワルイージスタジアム', 'ワルスタ', 'わるすた'}
bSiS = {'bsis', 'sis', 'bssy', 'ssy','Tour シンガポールスプラッシュ', 'Tourシンガポールスプラッシュ', 'シンガポールスプラッシュ', 'シンガポール', 'シンスプ', 'しんがぽーる', 'しんすぷ', 'シンガ', 'しんが'}


TRACKS = [['マリカス', MKS], ['ウォタパ', WP], ['スイキャニ', SSC], ['ドッスン', TR], \
    ['新マリサ', MC], ['ハーバー', TH], ['ねじマン', TM], ['ヘイこう', SGF], \
    ['くうこう', SA], ['ドルみ', DS], ['エレド', Ed], ['ワリスノ', MW], \
    ['スカガ', CC], ['ホネさば', BDD], ["クパキャ", BC], ['新虹', RR], \
    ['モモカン', rMMM], ['GBAマリサ', rMC], ['プクビ', rCCB], ["ハイウェイ", rTT], \
    ['GCカラさば', rDDD], ['へいや', rDP3], ['ピチサ', rRRy], ['ジャングル', rDKJ], \
    ['ワリスタ', rWS], ['シャベラン', rSL], ['ミューパ', rMP], ['ヨシバ', rYV], \
    ['チクタク', rTTC], ['パクスラ', rPPS], ['かざん', rGV], ['64虹', rRRd], \
    ['ヨシサ', dYC], ['エキバ', dEA], ['ドラロ', dDD], ['ミュート', dMC], \
    ["ワリこう", dWGM], ['SFC虹', dRR], ['ツルツル', dIIO], ['ハイラル', dHC], \
    ['ベビパ', dBP], ['チーズ', dCL], ['ネイチャー', dWW], ['どう森', dAC], \
    ['ネオパ', dNBC], ['リボン', dRiR], ['リンメト', dSBS], ['ビッグブルー', dBB], \
    ['パリ', bPP], ['キノサ', bTC], ['チョコ', bCMo], ['ココモ', bCMa], \
    ['トーキョー', bTB], ['リッジ', bSR], ['GBAスカガ', bSG], ['ニンニン', bNH], \
    ['ニューヨーク', bNYM], ['SFCマリサ', bMC3], ['64カラさば', bKD], ['ワルピン', bWP], \
    ['シドニー', bSS], ['スノラン', bSL], ['キノキャニ', bMG], ['アイス', bSHS], \
    ['ロンドン', bLL], ['レイク', bBL], ['ロック', bRRM], ['メイプル', bMT], \
    ['ベルリン', bBB], ['ピチガ', bPG], ['メリー', bMM], ['3DS虹', bRR7], \
    ['アムステルダム', bAD], ['リバパ', bRP], ['スノボ', bDKS], ['ヨシアイ', bYI], \
    ['バンコク', bBR], ['DSマリサ', bMC], ['ワルスタ', bWS], ['シンガポール', bSiS]]

TRACKS_EN = [['Mario Kart Stadium', MKS], ['Water Park', WP], ['Sweet Sweet Canyon', SSC], ['Thwomp Ruins', TR], \
    ['Mario Circuit', MC], ['Toad Harbor', TH], ['Twisted Mansion', TM], ['Shy Guy Falls', SGF], \
    ['Sunshine Airport', SA], ['Dolphin Shoals', DS], ['Electrodrome', Ed], ['Mount Wario', MW], \
    ['Cloudtop Cruise', CC], ['Bone-Dry Dunes', BDD], ["Bowser's Castle", BC], ['Rainbow Road', RR], \
    ['Wii Moo Moo Meadows', rMMM], ['GBA Mario Circuit', rMC], ['DS Cheep Cheep Beach', rCCB], ["N64 Toad's Turnpike", rTT], \
    ['GCN Dry Dry Desert', rDDD], ['SNES Donut Plains 3', rDP3], ['N64 Royal Raceway', rRRy], ['3DS DK Jungle', rDKJ], \
    ['DS Wario Stadium', rWS], ['GCN Sherbet Land', rSL], ['3DS Music Park', rMP], ['N64 Yoshi Valley', rYV], \
    ['DS Tick-Tock Clock', rTTC], ['3DS Piranha Plant Slide', rPPS], ['Wii Grumble Volcano', rGV], ['N64 Rainbow Road', rRRd], \
    ['GCN Yoshi Circuit', dYC], ['Excitebike Arena', dEA], ['Dragon Driftway', dDD], ['Mute City', dMC], \
    ["Wii Wario's Gold Mine", dWGM], ['SNES Rainbow Road', dRR], ['Ice Ice Outpost', dIIO], ['Hyrule Circuit', dHC], \
    ['GCN Baby Park', dBP], ['GBA Cheese Land', dCL], ['Wild Woods', dWW], ['Animal Crossing', dAC], \
    ['3DS Neo Bowser City', dNBC], ['GBA Ribbon Road', dRiR], ['Super Bell Subway', dSBS], ['Big Blue', dBB], \
    ['Tour Paris Promenade', bPP], ['3DS Toad Circuit', bTC], ['N64 Choco Mountain', bCMo], ['Wii Coconut Mall', bCMa], \
    ['Tour Tokyo Blur', bTB], ['DS Shroom Ridge', bSR], ['GBA Sky Garden', bSG], ['Tour Ninja Hideaway', bNH], \
    ['Tour New York Minute', bNYM], ['SNES Mario Circuit 3', bMC3], ['N64 Kalimari Desert', bKD], ['DS Waluigi Pinball', bWP], \
    ['Tour Sydney Sprint', bSS], ['GBA Snow Land', bSL], ['Wii Mushroom Gorge', bMG], ['Sky-High Sundae', bSHS], \
    ['Tour London Loop', bLL], ['GBA Boo Lake', bBL], ['3DS Rock Rock Mountain', bRRM], ['Wii Maple Treeway', bMT], \
    ['Tour Berlin Byways', bBB], ['DS Peach Gardens', bPG], ['Merry Mountain', bMM], ['3DS Rainbow Road', bRR7]]

TRACKS_JA = [['マリオカートスタジアム', MKS], ['ウォーターパーク', WP], ['スイーツキャニオン', SSC], ['ドッスンいせき', TR], \
    ['マリオサーキット', MC], ['キノピオハーバー', TH], ['ねじれマンション', TM], ['ヘイホーこうざん', SGF], \
    ['サンシャインくうこう', SA], ['ドルフィンみさき', DS], ['エレクトロドリーム', Ed], ['ワリオスノーマウンテン', MW], \
    ['スカイガーデン', CC], ['ホネホネさばく', BDD], ["クッパキャッスル", BC], ['レインボーロード', RR], \
    ['Wii モーモーカントリー', rMMM], ['GBA マリオサーキット', rMC], ['DS プクプクビーチ', rCCB], ["N64 キノピオハイウェイ", rTT], \
    ['GC カラカラさばく', rDDD], ['SFC ドーナツへいや3', rDP3], ['N64 ピーチサーキット', rRRy], ['3DS DKジャングル', rDKJ], \
    ['DS ワリオスタジアム', rWS], ['GC シャーベットランド', rSL], ['3DS ミュージックパーク', rMP], ['N64 ヨッシーバレー', rYV], \
    ['DS チクタクロック', rTTC], ['3DS パックンスライダー', rPPS], ['Wii グラグラかざん', rGV], ['N64 レインボーロード', rRRd], \
    ['GC ヨッシーサーキット', dYC], ['エキサイトバイク', dEA], ['ドラゴンロード', dDD], ['ミュートシティ', dMC], \
    ["Wii ワリオこうざん", dWGM], ['SFC レインボーロード', dRR], ['ツルツルツイスター', dIIO], ['ハイラルサーキット', dHC], \
    ['GC ベビィパーク', dBP], ['GBA チーズランド', dCL], ['ネイチャーロード', dWW], ['どうぶつの森', dAC], \
    ['3DS ネオクッパシティ', dNBC], ['GBA リボンロード', dRiR], ['リンリンメトロ', dSBS], ['ビッグブルー', dBB], \
    ['Tour パリプロムナード', bPP], ['3DS キノピオサーキット', bTC], ['N64 チョコマウンテン', bCMo], ['Wii ココナッツモール', bCMa], \
    ['Tour トーキョースクランブル', bTB], ['DS キノコリッジウェイ', bSR], ['GBA スカイガーデン', bSG], ['Tour ニンニンドージョー', bNH], \
    ['Tour ニューヨークドリーム', bNYM], ['SFC マリオサーキット3', bMC3], ['N64 カラカラさばく', bKD], ['DS ワルイージピンボール', bWP], \
    ['Tour シドニーサンシャイン', bSS], ['GBA スノーランド', bSL], ['Wii キノコキャニオン', bMG], ['アイスビルディング', bSHS], \
    ['Tour ロンドンアベニュー', bLL], ['GBA テレサレイク', bBL], ['3DS ロックロックマウンテン', bRRM], ['Wii メイプルツリーハウス', bMT], \
    ['Tour ベルリンシュトラーセ', bBB], ['DS ピーチガーデン', bPG], ['Tour メリーメリーマウンテン', bMM], ['3DS レインボーロード', bRR7]]